MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1A11B0AGP20000/mcu.h
typedef struct stc_intreq_irq21mon_field
{
    union {
        struct {
            __IO  uint32_t  MFSINT               :2;
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  DMAINT               :1;
            __IO  uint32_t  RESERVED1            :27;
        };
        struct {
            __IO  uint32_t  MFSINT0              :1;
            __IO  uint32_t  MFSINT1              :1;
            __IO  uint32_t  RESERVED2            :30;
        };
    };
} stc_intreq_irq21mon_field_t;

typedef struct stc_intreq_irq22mon_field
{
    union {
        struct {
            __IO  uint32_t  MFSINT               :4;
            __IO  uint32_t  DMAINT               :1;
            __IO  uint32_t  RESERVED0            :27;
        };
        struct {
            __IO  uint32_t  MFSINT0              :1;
            __IO  uint32_t  MFSINT1              :1;
            __IO  uint32_t  MFSINT2              :1;
            __IO  uint32_t  MFSINT3              :1;
            __IO  uint32_t  RESERVED1            :28;
        };
    };
} stc_intreq_irq22mon_field_t;

typedef struct stc_intreq_irq23mon_field
{
        __IO  uint32_t  PPGINT00                 :1;
        __IO  uint32_t  PPGINT02                 :1;
        __IO  uint32_t  PPGINT04                 :1;
        __IO  uint32_t  PPGINT08                 :1;
        __IO  uint32_t  PPGINT10                 :1;
        __IO  uint32_t  PPGINT12                 :1;
        __IO  uint32_t  PPGINT16                 :1;
        __IO  uint32_t  PPGINT18                 :1;
        __IO  uint32_t  PPGINT20                 :1;
        __IO  uint32_t  RESERVED0                :23;
} stc_intreq_irq23mon_field_t;

typedef struct stc_intreq_irq24mon_field
{
        __IO  uint32_t  MOSCINT                  :1;
        __IO  uint32_t  SOSCINT                  :1;
        __IO  uint32_t  MPLLINT                  :1;
        __IO  uint32_t  RESERVED0                :1;
        __IO  uint32_t  WCINT                    :1;
        __IO  uint32_t  RTCINT                   :1;
        __IO  uint32_t  RESERVED1                :26;
} stc_intreq_irq24mon_field_t;

typedef struct stc_intreq_irq25mon_field
{
        __IO  uint32_t  ADCINT0                  :1;
        __IO  uint32_t  ADCINT1                  :1;
        __IO  uint32_t  ADCINT2                  :1;
        __IO  uint32_t  ADCINT3                  :1;
        __IO  uint32_t  ADCINT4                  :1;
        __IO  uint32_t  RESERVED0                :27;
} stc_intreq_irq25mon_field_t;

typedef struct stc_intreq_irq26mon_field
{
        __IO  uint32_t  ADCINT0                  :1;
        __IO  uint32_t  ADCINT1                  :1;
        __IO  uint32_t  ADCINT2                  :1;
        __IO  uint32_t  ADCINT3                  :1;
        __IO  uint32_t  ADCINT4                  :1;
        __IO  uint32_t  RESERVED0                :27;
} stc_intreq_irq26mon_field_t;

typedef struct stc_intreq_irq27mon_field
{
        __IO  uint32_t  ADCINT0                  :1;
        __IO  uint32_t  ADCINT1                  :1;
        __IO  uint32_t  ADCINT2                  :1;
        __IO  uint32_t  ADCINT3                  :1;
        __IO  uint32_t  ADCINT4                  :1;
        __IO  uint32_t  LCDCINT                  :1;
        __IO  uint32_t  RESERVED0                :26;
} stc_intreq_irq27mon_field_t;

typedef struct stc_intreq_irq28mon_field
{
    union {
        struct {
            __IO  uint32_t  FRT0INT              :6;
            __IO  uint32_t  FRT1INT              :6;
            __IO  uint32_t  FRT2INT              :6;
            __IO  uint32_t  RESERVED0            :14;
        };
        struct {
            __IO  uint32_t  FRT0INT0             :1;
            __IO  uint32_t  FRT0INT1             :1;
            __IO  uint32_t  FRT0INT2             :1;
            __IO  uint32_t  FRT0INT3             :1;
            __IO  uint32_t  FRT0INT4             :1;
            __IO  uint32_t  FRT0INT5             :1;
            __IO  uint32_t  FRT1INT0             :1;
            __IO  uint32_t  FRT1INT1             :1;
            __IO  uint32_t  FRT1INT2             :1;
            __IO  uint32_t  FRT1INT3             :1;
            __IO  uint32_t  FRT1INT4             :1;
            __IO  uint32_t  FRT1INT5             :1;
            __IO  uint32_t  FRT2INT0             :1;
            __IO  uint32_t  FRT2INT1             :1;
            __IO  uint32_t  FRT2INT2             :1;
            __IO  uint32_t  FRT2INT3             :1;
            __IO  uint32_t  FRT2INT4             :1;
            __IO  uint32_t  FRT2INT5             :1;
            __IO  uint32_t  RESERVED1            :14;
        };
    };
} stc_intreq_irq28mon_field_t;

typedef struct stc_intreq_irq29mon_field
{
    union {
        struct {
            __IO  uint32_t  ICU0INT              :4;
            __IO  uint32_t  ICU1INT              :4;
            __IO  uint32_t  ICU2INT              :4;
            __IO  uint32_t  RESERVED0            :20;
        };
        struct {
            __IO  uint32_t  ICU0INT0             :1;
            __IO  uint32_t  ICU0INT1             :1;
            __IO  uint32_t  ICU0INT2             :1;
            __IO  uint32_t  ICU0INT3             :1;
            __IO  uint32_t  ICU1INT0             :1;
            __IO  uint32_t  ICU1INT1             :1;
            __IO  uint32_t  ICU1INT2             :1;
            __IO  uint32_t  ICU1INT3             :1;
            __IO  uint32_t  ICU2INT0             :1;
            __IO  uint32_t  ICU2INT1             :1;
            __IO  uint32_t  ICU2INT2             :1;
            __IO  uint32_t  ICU2INT3             :1;
            __IO  uint32_t  RESERVED1            :20;
        };
    };
} stc_intreq_irq29mon_field_t;

typedef struct stc_intreq_irq30mon_field
{
    union {
        struct {
            __IO  uint32_t  OCU0INT              :6;
            __IO  uint32_t  OCU1INT              :6;
            __IO  uint32_t  OCU2INT              :6;
            __IO  uint32_t  RESERVED0            :14;
        };
        struct {
            __IO  uint32_t  OCU0INT0             :1;
            __IO  uint32_t  OCU0INT1             :1;
            __IO  uint32_t  OCU0INT2             :1;
            __IO  uint32_t  OCU0INT3             :1;
            __IO  uint32_t  OCU0INT4             :1;
            __IO  uint32_t  OCU0INT5             :1;
            __IO  uint32_t  OCU1INT0             :1;
            __IO  uint32_t  OCU1INT1             :1;
            __IO  uint32_t  OCU1INT2             :1;
            __IO  uint32_t  OCU1INT3             :1;
            __IO  uint32_t  OCU1INT4             :1;
            __IO  uint32_t  OCU1INT5             :1;
            __IO  uint32_t  OCU2INT0             :1;
            __IO  uint32_t  OCU2INT1             :1;
            __IO  uint32_t  OCU2INT2             :1;
            __IO  uint32_t  OCU2INT3             :1;
            __IO  uint32_t  OCU2INT4             :1;
            __IO  uint32_t  OCU2INT5             :1;
            __IO  uint32_t  RESERVED1            :14;
        };
    };
} stc_intreq_irq30mon_field_t;

