MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1A11B0AGP20000/mcu.h
/*******************************************************************************
* Peripheral Memory Map
*******************************************************************************/
#define FM_FLASH_BASE                             (0x00000000UL) /* Flash Base Address */
#define FM0P_FLASH_BASE                           (0x00000000UL) /* Flash Base Address */
#define FM_PERIPH_BASE                            (0x40000000UL) /* Peripheral Base Address */
#define FM0P_PERIPH_BASE                          (0x40000000UL) /* Peripheral Base Address */
#define FM_CM0P_BASE                              (0xE0100000UL) /* CM0P Private */
#define FM0P_CM0P_BASE                            (0xE0100000UL) /* CM0P Private  */

#define FM_ADC0_BASE                              (0x40027000UL) /* ADC0 Base Address */
#define FM0P_ADC0_BASE                            (0x40027000UL) /* ADC0 Base Address */
#define FM_BT0_BASE                               (0x40025000UL) /* BT0 Base Address */
#define FM0P_BT0_BASE                             (0x40025000UL) /* BT0 Base Address */
#define FM_BT0_PPG_BASE                           (0x40025000UL) /* BT0 Base Address */
#define FM0P_BT0_PPG_BASE                         (0x40025000UL) /* BT0 Base Address */
#define FM_BT0_PWC_BASE                           (0x40025000UL) /* BT0 Base Address */
#define FM0P_BT0_PWC_BASE                         (0x40025000UL) /* BT0 Base Address */
#define FM_BT0_PWM_BASE                           (0x40025000UL) /* BT0 Base Address */
#define FM0P_BT0_PWM_BASE                         (0x40025000UL) /* BT0 Base Address */
#define FM_BT0_RT_BASE                            (0x40025000UL) /* BT0 Base Address */
#define FM0P_BT0_RT_BASE                          (0x40025000UL) /* BT0 Base Address */
#define FM_BT1_BASE                               (0x40025040UL) /* BT1 Base Address */
#define FM0P_BT1_BASE                             (0x40025040UL) /* BT1 Base Address */
#define FM_BT1_PPG_BASE                           (0x40025040UL) /* BT1 Base Address */
#define FM0P_BT1_PPG_BASE                         (0x40025040UL) /* BT1 Base Address */
#define FM_BT1_PWC_BASE                           (0x40025040UL) /* BT1 Base Address */
#define FM0P_BT1_PWC_BASE                         (0x40025040UL) /* BT1 Base Address */
#define FM_BT1_PWM_BASE                           (0x40025040UL) /* BT1 Base Address */
#define FM0P_BT1_PWM_BASE                         (0x40025040UL) /* BT1 Base Address */
#define FM_BT1_RT_BASE                            (0x40025040UL) /* BT1 Base Address */
#define FM0P_BT1_RT_BASE                          (0x40025040UL) /* BT1 Base Address */
#define FM_BT2_BASE                               (0x40025080UL) /* BT2 Base Address */
#define FM0P_BT2_BASE                             (0x40025080UL) /* BT2 Base Address */
#define FM_BT2_PPG_BASE                           (0x40025080UL) /* BT2 Base Address */
#define FM0P_BT2_PPG_BASE                         (0x40025080UL) /* BT2 Base Address */
#define FM_BT2_PWC_BASE                           (0x40025080UL) /* BT2 Base Address */
#define FM0P_BT2_PWC_BASE                         (0x40025080UL) /* BT2 Base Address */
#define FM_BT2_PWM_BASE                           (0x40025080UL) /* BT2 Base Address */
#define FM0P_BT2_PWM_BASE                         (0x40025080UL) /* BT2 Base Address */
#define FM_BT2_RT_BASE                            (0x40025080UL) /* BT2 Base Address */
#define FM0P_BT2_RT_BASE                          (0x40025080UL) /* BT2 Base Address */
#define FM_BT3_BASE                               (0x400250C0UL) /* BT3 Base Address */
#define FM0P_BT3_BASE                             (0x400250C0UL) /* BT3 Base Address */
#define FM_BT3_PPG_BASE                           (0x400250C0UL) /* BT3 Base Address */
#define FM0P_BT3_PPG_BASE                         (0x400250C0UL) /* BT3 Base Address */
#define FM_BT3_PWC_BASE                           (0x400250C0UL) /* BT3 Base Address */
#define FM0P_BT3_PWC_BASE                         (0x400250C0UL) /* BT3 Base Address */
#define FM_BT3_PWM_BASE                           (0x400250C0UL) /* BT3 Base Address */
#define FM0P_BT3_PWM_BASE                         (0x400250C0UL) /* BT3 Base Address */
#define FM_BT3_RT_BASE                            (0x400250C0UL) /* BT3 Base Address */
#define FM0P_BT3_RT_BASE                          (0x400250C0UL) /* BT3 Base Address */
#define FM_BTIOSEL03_BASE                         (0x40025100UL) /* BTIOSEL03 Base Address */
#define FM0P_BTIOSEL03_BASE                       (0x40025100UL) /* BTIOSEL03 Base Address */
#define FM_CLK_GATING_BASE                        (0x4003C100UL) /* CLK_GATING Base Address */
#define FM0P_CLK_GATING_BASE                      (0x4003C100UL) /* CLK_GATING Base Address */
#define FM_CRC_BASE                               (0x40039000UL) /* CRC Base Address */
#define FM0P_CRC_BASE                             (0x40039000UL) /* CRC Base Address */
#define FM_CRG_BASE                               (0x40010000UL) /* CRG Base Address */
#define FM0P_CRG_BASE                             (0x40010000UL) /* CRG Base Address */
#define FM_CRTRIM_BASE                            (0x4002E000UL) /* CRTRIM Base Address */
#define FM0P_CRTRIM_BASE                          (0x4002E000UL) /* CRTRIM Base Address */
#define FM_DMAC_BASE                              (0x40060000UL) /* DMAC Base Address */
#define FM0P_DMAC_BASE                            (0x40060000UL) /* DMAC Base Address */
#define FM_DS_BASE                                (0x40035100UL) /* DS Base Address */
#define FM0P_DS_BASE                              (0x40035100UL) /* DS Base Address */
#define FM_DT_BASE                                (0x40015000UL) /* DT Base Address */
#define FM0P_DT_BASE                              (0x40015000UL) /* DT Base Address */
#define FM_EXTI_BASE                              (0x40030000UL) /* EXTI Base Address */
#define FM0P_EXTI_BASE                            (0x40030000UL) /* EXTI Base Address */
#define FM_FASTIO_BASE                            (0xF8000000UL) /* FASTIO Base Address */
#define FM0P_FASTIO_BASE                          (0xF8000000UL) /* FASTIO Base Address */
#define FM_FLASH_IF_BASE                          (0x40000000UL) /* FLASH_IF Base Address */
#define FM0P_FLASH_IF_BASE                        (0x40000000UL) /* FLASH_IF Base Address */
#define FM_GPIO_BASE                              (0x40033000UL) /* GPIO Base Address */
#define FM0P_GPIO_BASE                            (0x40033000UL) /* GPIO Base Address */
#define FM_HWWDT_BASE                             (0x40011000UL) /* HWWDT Base Address */
#define FM0P_HWWDT_BASE                           (0x40011000UL) /* HWWDT Base Address */
#define FM_INTREQ_BASE                            (0x40031000UL) /* INTREQ Base Address */
#define FM0P_INTREQ_BASE                          (0x40031000UL) /* INTREQ Base Address */
#define FM_LSCRP_BASE                             (0x4003C000UL) /* LSCRP Base Address */
#define FM0P_LSCRP_BASE                           (0x4003C000UL) /* LSCRP Base Address */
#define FM_LVD_BASE                               (0x40035000UL) /* LVD Base Address */
#define FM0P_LVD_BASE                             (0x40035000UL) /* LVD Base Address */
#define FM_MFS0_BASE                              (0x40038000UL) /* MFS0 Base Address */
#define FM0P_MFS0_BASE                            (0x40038000UL) /* MFS0 Base Address */
#define FM_MFS0_CSIO_BASE                         (0x40038000UL) /* MFS0 Base Address */
#define FM0P_MFS0_CSIO_BASE                       (0x40038000UL) /* MFS0 Base Address */
#define FM_MFS0_I2C_BASE                          (0x40038000UL) /* MFS0 Base Address */
#define FM0P_MFS0_I2C_BASE                        (0x40038000UL) /* MFS0 Base Address */
#define FM_MFS0_LIN_BASE                          (0x40038000UL) /* MFS0 Base Address */
#define FM0P_MFS0_LIN_BASE                        (0x40038000UL) /* MFS0 Base Address */
#define FM_MFS0_UART_BASE                         (0x40038000UL) /* MFS0 Base Address */
#define FM0P_MFS0_UART_BASE                       (0x40038000UL) /* MFS0 Base Address */
#define FM_MFS1_BASE                              (0x40038100UL) /* MFS1 Base Address */
#define FM0P_MFS1_BASE                            (0x40038100UL) /* MFS1 Base Address */
#define FM_MFS1_CSIO_BASE                         (0x40038100UL) /* MFS1 Base Address */
#define FM0P_MFS1_CSIO_BASE                       (0x40038100UL) /* MFS1 Base Address */
#define FM_MFS1_I2C_BASE                          (0x40038100UL) /* MFS1 Base Address */
#define FM0P_MFS1_I2C_BASE                        (0x40038100UL) /* MFS1 Base Address */
#define FM_MFS1_LIN_BASE                          (0x40038100UL) /* MFS1 Base Address */
#define FM0P_MFS1_LIN_BASE                        (0x40038100UL) /* MFS1 Base Address */
#define FM_MFS1_UART_BASE                         (0x40038100UL) /* MFS1 Base Address */
#define FM0P_MFS1_UART_BASE                       (0x40038100UL) /* MFS1 Base Address */
#define FM_MFS3_BASE                              (0x40038300UL) /* MFS3 Base Address */
#define FM0P_MFS3_BASE                            (0x40038300UL) /* MFS3 Base Address */
#define FM_MFS3_CSIO_BASE                         (0x40038300UL) /* MFS3 Base Address */
#define FM0P_MFS3_CSIO_BASE                       (0x40038300UL) /* MFS3 Base Address */
#define FM_MFS3_I2C_BASE                          (0x40038300UL) /* MFS3 Base Address */
#define FM0P_MFS3_I2C_BASE                        (0x40038300UL) /* MFS3 Base Address */
#define FM_MFS3_LIN_BASE                          (0x40038300UL) /* MFS3 Base Address */
#define FM0P_MFS3_LIN_BASE                        (0x40038300UL) /* MFS3 Base Address */
#define FM_MFS3_UART_BASE                         (0x40038300UL) /* MFS3 Base Address */
#define FM0P_MFS3_UART_BASE                       (0x40038300UL) /* MFS3 Base Address */
#define FM_MFT_PPG_BASE                           (0x40024000UL) /* MFT_PPG Base Address */
#define FM0P_MFT_PPG_BASE                         (0x40024000UL) /* MFT_PPG Base Address */
#define FM_MFT0_BASE                              (0x40020000UL) /* MFT0 Base Address */
#define FM0P_MFT0_BASE                            (0x40020000UL) /* MFT0 Base Address */
#define FM_MFT0_ADCMP_BASE                        (0x40020000UL) /* MFT0 Base Address */
#define FM0P_MFT0_ADCMP_BASE                      (0x40020000UL) /* MFT0 Base Address */
#define FM_MFT0_FRT_BASE                          (0x40020000UL) /* MFT0 Base Address */
#define FM0P_MFT0_FRT_BASE                        (0x40020000UL) /* MFT0 Base Address */
#define FM_MFT0_ICU_BASE                          (0x40020000UL) /* MFT0 Base Address */
#define FM0P_MFT0_ICU_BASE                        (0x40020000UL) /* MFT0 Base Address */
#define FM_MFT0_OCU_BASE                          (0x40020000UL) /* MFT0 Base Address */
#define FM0P_MFT0_OCU_BASE                        (0x40020000UL) /* MFT0 Base Address */
#define FM_MFT0_WFG_BASE                          (0x40020000UL) /* MFT0 Base Address */
#define FM0P_MFT0_WFG_BASE                        (0x40020000UL) /* MFT0 Base Address */
#define FM_MTB_DWT_BASE                           (0xF0001000UL) /* MTB_DWT Base Address */
#define FM0P_MTB_DWT_BASE                         (0xF0001000UL) /* MTB_DWT Base Address */
#define FM_QPRC0_BASE                             (0x40026000UL) /* QPRC0 Base Address */
#define FM0P_QPRC0_BASE                           (0x40026000UL) /* QPRC0 Base Address */
#define FM_QPRC0_NF_BASE                          (0x40026100UL) /* QPRC0_NF Base Address */
#define FM0P_QPRC0_NF_BASE                        (0x40026100UL) /* QPRC0_NF Base Address */
#define FM_RTC_BASE                               (0x4003B000UL) /* RTC Base Address */
#define FM0P_RTC_BASE                             (0x4003B000UL) /* RTC Base Address */
#define FM_SBSSR_BASE                             (0x40025F00UL) /* SBSSR Base Address */
#define FM0P_SBSSR_BASE                           (0x40025F00UL) /* SBSSR Base Address */
#define FM_SWWDT_BASE                             (0x40012000UL) /* SWWDT Base Address */
#define FM0P_SWWDT_BASE                           (0x40012000UL) /* SWWDT Base Address */
#define FM_UNIQUE_ID_BASE                         (0x40000200UL) /* UNIQUE_ID Base Address */
#define FM0P_UNIQUE_ID_BASE                       (0x40000200UL) /* UNIQUE_ID Base Address */
#define FM_WC_BASE                                (0x4003A000UL) /* WC Base Address */
#define FM0P_WC_BASE                              (0x4003A000UL) /* WC Base Address */
/*******************************************************************************
* Peripheral declaration
*******************************************************************************/
#define FM0P_ADC0                                 ((FM_ADC_TypeDef *)FM0P_ADC0_BASE)
#define FM_ADC0                                   ((FM_ADC_TypeDef *)FM0P_ADC0_BASE)
#define FM0P_BT0                                  ((FM_BT_TypeDef *)FM0P_BT0_BASE)
#define FM_BT0                                    ((FM_BT_TypeDef *)FM0P_BT0_BASE)
#define FM0P_BT0_PPG                              ((FM_BT_PPG_TypeDef *)FM0P_BT0_BASE)
#define FM_BT0_PPG                                ((FM_BT_PPG_TypeDef *)FM0P_BT0_BASE)
#define FM0P_BT0_PWC                              ((FM_BT_PWC_TypeDef *)FM0P_BT0_BASE)
#define FM_BT0_PWC                                ((FM_BT_PWC_TypeDef *)FM0P_BT0_BASE)
#define FM0P_BT0_PWM                              ((FM_BT_PWM_TypeDef *)FM0P_BT0_BASE)
#define FM_BT0_PWM                                ((FM_BT_PWM_TypeDef *)FM0P_BT0_BASE)
#define FM0P_BT0_RT                               ((FM_BT_RT_TypeDef *)FM0P_BT0_BASE)
#define FM_BT0_RT                                 ((FM_BT_RT_TypeDef *)FM0P_BT0_BASE)
#define FM0P_BT1                                  ((FM_BT_TypeDef *)FM0P_BT1_BASE)
#define FM_BT1                                    ((FM_BT_TypeDef *)FM0P_BT1_BASE)
#define FM0P_BT1_PPG                              ((FM_BT_PPG_TypeDef *)FM0P_BT1_BASE)
#define FM_BT1_PPG                                ((FM_BT_PPG_TypeDef *)FM0P_BT1_BASE)
#define FM0P_BT1_PWC                              ((FM_BT_PWC_TypeDef *)FM0P_BT1_BASE)
#define FM_BT1_PWC                                ((FM_BT_PWC_TypeDef *)FM0P_BT1_BASE)
#define FM0P_BT1_PWM                              ((FM_BT_PWM_TypeDef *)FM0P_BT1_BASE)
#define FM_BT1_PWM                                ((FM_BT_PWM_TypeDef *)FM0P_BT1_BASE)
#define FM0P_BT1_RT                               ((FM_BT_RT_TypeDef *)FM0P_BT1_BASE)
#define FM_BT1_RT                                 ((FM_BT_RT_TypeDef *)FM0P_BT1_BASE)
#define FM0P_BT2                                  ((FM_BT_TypeDef *)FM0P_BT2_BASE)
#define FM_BT2                                    ((FM_BT_TypeDef *)FM0P_BT2_BASE)
#define FM0P_BT2_PPG                              ((FM_BT_PPG_TypeDef *)FM0P_BT2_BASE)
#define FM_BT2_PPG                                ((FM_BT_PPG_TypeDef *)FM0P_BT2_BASE)
#define FM0P_BT2_PWC                              ((FM_BT_PWC_TypeDef *)FM0P_BT2_BASE)
#define FM_BT2_PWC                                ((FM_BT_PWC_TypeDef *)FM0P_BT2_BASE)
#define FM0P_BT2_PWM                              ((FM_BT_PWM_TypeDef *)FM0P_BT2_BASE)
#define FM_BT2_PWM                                ((FM_BT_PWM_TypeDef *)FM0P_BT2_BASE)
#define FM0P_BT2_RT                               ((FM_BT_RT_TypeDef *)FM0P_BT2_BASE)
#define FM_BT2_RT                                 ((FM_BT_RT_TypeDef *)FM0P_BT2_BASE)
#define FM0P_BT3                                  ((FM_BT_TypeDef *)FM0P_BT3_BASE)
#define FM_BT3                                    ((FM_BT_TypeDef *)FM0P_BT3_BASE)
#define FM0P_BT3_PPG                              ((FM_BT_PPG_TypeDef *)FM0P_BT3_BASE)
#define FM_BT3_PPG                                ((FM_BT_PPG_TypeDef *)FM0P_BT3_BASE)
#define FM0P_BT3_PWC                              ((FM_BT_PWC_TypeDef *)FM0P_BT3_BASE)
#define FM_BT3_PWC                                ((FM_BT_PWC_TypeDef *)FM0P_BT3_BASE)
#define FM0P_BT3_PWM                              ((FM_BT_PWM_TypeDef *)FM0P_BT3_BASE)
#define FM_BT3_PWM                                ((FM_BT_PWM_TypeDef *)FM0P_BT3_BASE)
#define FM0P_BT3_RT                               ((FM_BT_RT_TypeDef *)FM0P_BT3_BASE)
#define FM_BT3_RT                                 ((FM_BT_RT_TypeDef *)FM0P_BT3_BASE)
#define FM0P_BTIOSEL03                            ((FM_BTIOSEL03_TypeDef *)FM0P_BTIOSEL03_BASE)
#define FM_BTIOSEL03                              ((FM_BTIOSEL03_TypeDef *)FM0P_BTIOSEL03_BASE)
#define FM0P_CLK_GATING                           ((FM_CLK_GATING_TypeDef *)FM0P_CLK_GATING_BASE)
#define FM_CLK_GATING                             ((FM_CLK_GATING_TypeDef *)FM0P_CLK_GATING_BASE)
#define FM0P_CRC                                  ((FM_CRC_TypeDef *)FM0P_CRC_BASE)
#define FM_CRC                                    ((FM_CRC_TypeDef *)FM0P_CRC_BASE)
#define FM0P_CRG                                  ((FM_CRG_TypeDef *)FM0P_CRG_BASE)
#define FM_CRG                                    ((FM_CRG_TypeDef *)FM0P_CRG_BASE)
#define FM0P_CRTRIM                               ((FM_CRTRIM_TypeDef *)FM0P_CRTRIM_BASE)
#define FM_CRTRIM                                 ((FM_CRTRIM_TypeDef *)FM0P_CRTRIM_BASE)
#define FM0P_DMAC                                 ((FM_DMAC_TypeDef *)FM0P_DMAC_BASE)
#define FM_DMAC                                   ((FM_DMAC_TypeDef *)FM0P_DMAC_BASE)
#define FM0P_DS                                   ((FM_DS_TypeDef *)FM0P_DS_BASE)
#define FM_DS                                     ((FM_DS_TypeDef *)FM0P_DS_BASE)
#define FM0P_DT                                   ((FM_DT_TypeDef *)FM0P_DT_BASE)
#define FM_DT                                     ((FM_DT_TypeDef *)FM0P_DT_BASE)
#define FM0P_EXTI                                 ((FM_EXTI_TypeDef *)FM0P_EXTI_BASE)
#define FM_EXTI                                   ((FM_EXTI_TypeDef *)FM0P_EXTI_BASE)
#define FM0P_FASTIO                               ((FM_FASTIO_TypeDef *)FM0P_FASTIO_BASE)
#define FM_FASTIO                                 ((FM_FASTIO_TypeDef *)FM0P_FASTIO_BASE)
#define FM0P_FLASH_IF                             ((FM_FLASH_IF_TypeDef *)FM0P_FLASH_IF_BASE)
#define FM_FLASH_IF                               ((FM_FLASH_IF_TypeDef *)FM0P_FLASH_IF_BASE)
#define FM0P_GPIO                                 ((FM_GPIO_TypeDef *)FM0P_GPIO_BASE)
#define FM_GPIO                                   ((FM_GPIO_TypeDef *)FM0P_GPIO_BASE)
#define FM0P_HWWDT                                ((FM_HWWDT_TypeDef *)FM0P_HWWDT_BASE)
#define FM_HWWDT                                  ((FM_HWWDT_TypeDef *)FM0P_HWWDT_BASE)
#define FM0P_INTREQ                               ((FM_INTREQ_TypeDef *)FM0P_INTREQ_BASE)
#define FM_INTREQ                                 ((FM_INTREQ_TypeDef *)FM0P_INTREQ_BASE)
#define FM0P_LSCRP                                ((FM_LSCRP_TypeDef *)FM0P_LSCRP_BASE)
#define FM_LSCRP                                  ((FM_LSCRP_TypeDef *)FM0P_LSCRP_BASE)
#define FM0P_LVD                                  ((FM_LVD_TypeDef *)FM0P_LVD_BASE)
#define FM_LVD                                    ((FM_LVD_TypeDef *)FM0P_LVD_BASE)
#define FM0P_MFS0                                 ((FM_MFS_TypeDef *)FM0P_MFS0_BASE)
#define FM_MFS0                                   ((FM_MFS_TypeDef *)FM0P_MFS0_BASE)
#define FM0P_MFS0_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM0P_MFS0_BASE)
#define FM_MFS0_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM0P_MFS0_BASE)
#define FM0P_MFS0_I2C                             ((FM_MFS_I2C_TypeDef *)FM0P_MFS0_BASE)
#define FM_MFS0_I2C                               ((FM_MFS_I2C_TypeDef *)FM0P_MFS0_BASE)
#define FM0P_MFS0_LIN                             ((FM_MFS_LIN_TypeDef *)FM0P_MFS0_BASE)
#define FM_MFS0_LIN                               ((FM_MFS_LIN_TypeDef *)FM0P_MFS0_BASE)
#define FM0P_MFS0_UART                            ((FM_MFS_UART_TypeDef *)FM0P_MFS0_BASE)
#define FM_MFS0_UART                              ((FM_MFS_UART_TypeDef *)FM0P_MFS0_BASE)
#define FM0P_MFS1                                 ((FM_MFS_TypeDef *)FM0P_MFS1_BASE)
#define FM_MFS1                                   ((FM_MFS_TypeDef *)FM0P_MFS1_BASE)
#define FM0P_MFS1_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM0P_MFS1_BASE)
#define FM_MFS1_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM0P_MFS1_BASE)
#define FM0P_MFS1_I2C                             ((FM_MFS_I2C_TypeDef *)FM0P_MFS1_BASE)
#define FM_MFS1_I2C                               ((FM_MFS_I2C_TypeDef *)FM0P_MFS1_BASE)
#define FM0P_MFS1_LIN                             ((FM_MFS_LIN_TypeDef *)FM0P_MFS1_BASE)
#define FM_MFS1_LIN                               ((FM_MFS_LIN_TypeDef *)FM0P_MFS1_BASE)
#define FM0P_MFS1_UART                            ((FM_MFS_UART_TypeDef *)FM0P_MFS1_BASE)
#define FM_MFS1_UART                              ((FM_MFS_UART_TypeDef *)FM0P_MFS1_BASE)
#define FM0P_MFS3                                 ((FM_MFS_TypeDef *)FM0P_MFS3_BASE)
#define FM_MFS3                                   ((FM_MFS_TypeDef *)FM0P_MFS3_BASE)
#define FM0P_MFS3_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM0P_MFS3_BASE)
#define FM_MFS3_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM0P_MFS3_BASE)
#define FM0P_MFS3_I2C                             ((FM_MFS_I2C_TypeDef *)FM0P_MFS3_BASE)
#define FM_MFS3_I2C                               ((FM_MFS_I2C_TypeDef *)FM0P_MFS3_BASE)
#define FM0P_MFS3_LIN                             ((FM_MFS_LIN_TypeDef *)FM0P_MFS3_BASE)
#define FM_MFS3_LIN                               ((FM_MFS_LIN_TypeDef *)FM0P_MFS3_BASE)
#define FM0P_MFS3_UART                            ((FM_MFS_UART_TypeDef *)FM0P_MFS3_BASE)
#define FM_MFS3_UART                              ((FM_MFS_UART_TypeDef *)FM0P_MFS3_BASE)
#define FM0P_MFT_PPG                              ((FM_MFT_PPG_TypeDef *)FM0P_MFT_PPG_BASE)
#define FM_MFT_PPG                                ((FM_MFT_PPG_TypeDef *)FM0P_MFT_PPG_BASE)
#define FM0P_MFT0                                 ((FM_MFT_TypeDef *)FM0P_MFT0_BASE)
#define FM_MFT0                                   ((FM_MFT_TypeDef *)FM0P_MFT0_BASE)
#define FM0P_MFT0_ADCMP                           ((FM_MFT_ADCMP_TypeDef *)FM0P_MFT0_BASE)
#define FM_MFT0_ADCMP                             ((FM_MFT_ADCMP_TypeDef *)FM0P_MFT0_BASE)
#define FM0P_MFT0_FRT                             ((FM_MFT_FRT_TypeDef *)FM0P_MFT0_BASE)
#define FM_MFT0_FRT                               ((FM_MFT_FRT_TypeDef *)FM0P_MFT0_BASE)
#define FM0P_MFT0_ICU                             ((FM_MFT_ICU_TypeDef *)FM0P_MFT0_BASE)
#define FM_MFT0_ICU                               ((FM_MFT_ICU_TypeDef *)FM0P_MFT0_BASE)
#define FM0P_MFT0_OCU                             ((FM_MFT_OCU_TypeDef *)FM0P_MFT0_BASE)
#define FM_MFT0_OCU                               ((FM_MFT_OCU_TypeDef *)FM0P_MFT0_BASE)
#define FM0P_MFT0_WFG                             ((FM_MFT_WFG_TypeDef *)FM0P_MFT0_BASE)
#define FM_MFT0_WFG                               ((FM_MFT_WFG_TypeDef *)FM0P_MFT0_BASE)
#define FM0P_MTB_DWT                              ((FM_MTB_DWT_TypeDef *)FM0P_MTB_DWT_BASE)
#define FM_MTB_DWT                                ((FM_MTB_DWT_TypeDef *)FM0P_MTB_DWT_BASE)
#define FM0P_QPRC0                                ((FM_QPRC_TypeDef *)FM0P_QPRC0_BASE)
#define FM_QPRC0                                  ((FM_QPRC_TypeDef *)FM0P_QPRC0_BASE)
#define FM0P_QPRC0_NF                             ((FM_QPRC_NF_TypeDef *)FM0P_QPRC0_NF_BASE)
#define FM_QPRC0_NF                               ((FM_QPRC_NF_TypeDef *)FM0P_QPRC0_NF_BASE)
#define FM0P_RTC                                  ((FM_RTC_TypeDef *)FM0P_RTC_BASE)
#define FM_RTC                                    ((FM_RTC_TypeDef *)FM0P_RTC_BASE)
#define FM0P_SBSSR                                ((FM_SBSSR_TypeDef *)FM0P_SBSSR_BASE)
