MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1A11B0AGP20000/mcu.h
#define bFM_EXTI_NMICL_NCL                        *((volatile  uint8_t *)(0x42600300UL))
#define bFM0P_EXTI_NMICL_NCL                      *((volatile  uint8_t *)(0x42600300UL))

#define bFM_EXTI_NMIRR_NR                         *((volatile  uint8_t *)(0x42600280UL))
#define bFM0P_EXTI_NMIRR_NR                       *((volatile  uint8_t *)(0x42600280UL))


/*******************************************************************************
* FASTIO Registers FASTIO
*   Bitband Section
*******************************************************************************/
#define bFM_FASTIO_FPDIR0_P1                      *((volatile  uint8_t *)(0xF8010008UL))
#define bFM0P_FASTIO_FPDIR0_P1                    *((volatile  uint8_t *)(0xF8010008UL))
#define bFM_FASTIO_FPDIR0_P3                      *((volatile  uint8_t *)(0xF8010020UL))
#define bFM0P_FASTIO_FPDIR0_P3                    *((volatile  uint8_t *)(0xF8010020UL))
#define bFM_FASTIO_FPDIR0_P4                      *((volatile  uint8_t *)(0xF8010040UL))
#define bFM0P_FASTIO_FPDIR0_P4                    *((volatile  uint8_t *)(0xF8010040UL))
#define bFM_FASTIO_FPDIR0_PF                      *((volatile  uint8_t *)(0xF8010201UL))
#define bFM0P_FASTIO_FPDIR0_PF                    *((volatile  uint8_t *)(0xF8010201UL))

#define bFM_FASTIO_FPDIR1_P1                      *((volatile  uint8_t *)(0xF8010408UL))
#define bFM0P_FASTIO_FPDIR1_P1                    *((volatile  uint8_t *)(0xF8010408UL))
#define bFM_FASTIO_FPDIR1_P2                      *((volatile  uint8_t *)(0xF8010410UL))
#define bFM0P_FASTIO_FPDIR1_P2                    *((volatile  uint8_t *)(0xF8010410UL))
#define bFM_FASTIO_FPDIR1_P3                      *((volatile  uint8_t *)(0xF8010420UL))
#define bFM0P_FASTIO_FPDIR1_P3                    *((volatile  uint8_t *)(0xF8010420UL))

#define bFM_FASTIO_FPDIR2_P1                      *((volatile  uint8_t *)(0xF8010808UL))
#define bFM0P_FASTIO_FPDIR2_P1                    *((volatile  uint8_t *)(0xF8010808UL))
#define bFM_FASTIO_FPDIR2_P2                      *((volatile  uint8_t *)(0xF8010810UL))
#define bFM0P_FASTIO_FPDIR2_P2                    *((volatile  uint8_t *)(0xF8010810UL))
#define bFM_FASTIO_FPDIR2_P3                      *((volatile  uint8_t *)(0xF8010820UL))
#define bFM0P_FASTIO_FPDIR2_P3                    *((volatile  uint8_t *)(0xF8010820UL))

#define bFM_FASTIO_FPDIR3_PA                      *((volatile  uint8_t *)(0xF8010C11UL))
#define bFM0P_FASTIO_FPDIR3_PA                    *((volatile  uint8_t *)(0xF8010C11UL))
#define bFM_FASTIO_FPDIR3_PB                      *((volatile  uint8_t *)(0xF8010C21UL))
#define bFM0P_FASTIO_FPDIR3_PB                    *((volatile  uint8_t *)(0xF8010C21UL))
#define bFM_FASTIO_FPDIR3_PC                      *((volatile  uint8_t *)(0xF8010C41UL))
#define bFM0P_FASTIO_FPDIR3_PC                    *((volatile  uint8_t *)(0xF8010C41UL))
#define bFM_FASTIO_FPDIR3_PD                      *((volatile  uint8_t *)(0xF8010C81UL))
#define bFM0P_FASTIO_FPDIR3_PD                    *((volatile  uint8_t *)(0xF8010C81UL))
#define bFM_FASTIO_FPDIR3_PE                      *((volatile  uint8_t *)(0xF8010D01UL))
#define bFM0P_FASTIO_FPDIR3_PE                    *((volatile  uint8_t *)(0xF8010D01UL))
#define bFM_FASTIO_FPDIR3_PF                      *((volatile  uint8_t *)(0xF8010E01UL))
#define bFM0P_FASTIO_FPDIR3_PF                    *((volatile  uint8_t *)(0xF8010E01UL))

#define bFM_FASTIO_FPDIR4_P6                      *((volatile  uint8_t *)(0xF8011100UL))
#define bFM0P_FASTIO_FPDIR4_P6                    *((volatile  uint8_t *)(0xF8011100UL))
#define bFM_FASTIO_FPDIR4_P7                      *((volatile  uint8_t *)(0xF8011200UL))
#define bFM0P_FASTIO_FPDIR4_P7                    *((volatile  uint8_t *)(0xF8011200UL))

#define bFM_FASTIO_FPDIR6_P0                      *((volatile  uint8_t *)(0xF8011804UL))
#define bFM0P_FASTIO_FPDIR6_P0                    *((volatile  uint8_t *)(0xF8011804UL))
#define bFM_FASTIO_FPDIR6_P1                      *((volatile  uint8_t *)(0xF8011808UL))
#define bFM0P_FASTIO_FPDIR6_P1                    *((volatile  uint8_t *)(0xF8011808UL))

#define bFM_FASTIO_FPDIRE_P0                      *((volatile  uint8_t *)(0xF8013804UL))
#define bFM0P_FASTIO_FPDIRE_P0                    *((volatile  uint8_t *)(0xF8013804UL))
#define bFM_FASTIO_FPDIRE_P2                      *((volatile  uint8_t *)(0xF8013810UL))
#define bFM0P_FASTIO_FPDIRE_P2                    *((volatile  uint8_t *)(0xF8013810UL))
#define bFM_FASTIO_FPDIRE_P3                      *((volatile  uint8_t *)(0xF8013820UL))
#define bFM0P_FASTIO_FPDIRE_P3                    *((volatile  uint8_t *)(0xF8013820UL))

#define bFM_FASTIO_FPDOR0_P1                      *((volatile  uint8_t *)(0xF8014008UL))
#define bFM0P_FASTIO_FPDOR0_P1                    *((volatile  uint8_t *)(0xF8014008UL))
#define bFM_FASTIO_FPDOR0_P3                      *((volatile  uint8_t *)(0xF8014020UL))
#define bFM0P_FASTIO_FPDOR0_P3                    *((volatile  uint8_t *)(0xF8014020UL))
#define bFM_FASTIO_FPDOR0_P4                      *((volatile  uint8_t *)(0xF8014040UL))
#define bFM0P_FASTIO_FPDOR0_P4                    *((volatile  uint8_t *)(0xF8014040UL))
#define bFM_FASTIO_FPDOR0_PF                      *((volatile  uint8_t *)(0xF8014201UL))
#define bFM0P_FASTIO_FPDOR0_PF                    *((volatile  uint8_t *)(0xF8014201UL))

#define bFM_FASTIO_FPDOR1_P1                      *((volatile  uint8_t *)(0xF8014408UL))
#define bFM0P_FASTIO_FPDOR1_P1                    *((volatile  uint8_t *)(0xF8014408UL))
#define bFM_FASTIO_FPDOR1_P2                      *((volatile  uint8_t *)(0xF8014410UL))
#define bFM0P_FASTIO_FPDOR1_P2                    *((volatile  uint8_t *)(0xF8014410UL))
#define bFM_FASTIO_FPDOR1_P3                      *((volatile  uint8_t *)(0xF8014420UL))
#define bFM0P_FASTIO_FPDOR1_P3                    *((volatile  uint8_t *)(0xF8014420UL))

#define bFM_FASTIO_FPDOR2_P1                      *((volatile  uint8_t *)(0xF8014808UL))
#define bFM0P_FASTIO_FPDOR2_P1                    *((volatile  uint8_t *)(0xF8014808UL))
#define bFM_FASTIO_FPDOR2_P2                      *((volatile  uint8_t *)(0xF8014810UL))
#define bFM0P_FASTIO_FPDOR2_P2                    *((volatile  uint8_t *)(0xF8014810UL))
#define bFM_FASTIO_FPDOR2_P3                      *((volatile  uint8_t *)(0xF8014820UL))
#define bFM0P_FASTIO_FPDOR2_P3                    *((volatile  uint8_t *)(0xF8014820UL))

#define bFM_FASTIO_FPDOR3_PA                      *((volatile  uint8_t *)(0xF8014C11UL))
#define bFM0P_FASTIO_FPDOR3_PA                    *((volatile  uint8_t *)(0xF8014C11UL))
#define bFM_FASTIO_FPDOR3_PB                      *((volatile  uint8_t *)(0xF8014C21UL))
#define bFM0P_FASTIO_FPDOR3_PB                    *((volatile  uint8_t *)(0xF8014C21UL))
#define bFM_FASTIO_FPDOR3_PC                      *((volatile  uint8_t *)(0xF8014C41UL))
#define bFM0P_FASTIO_FPDOR3_PC                    *((volatile  uint8_t *)(0xF8014C41UL))
#define bFM_FASTIO_FPDOR3_PD                      *((volatile  uint8_t *)(0xF8014C81UL))
#define bFM0P_FASTIO_FPDOR3_PD                    *((volatile  uint8_t *)(0xF8014C81UL))
#define bFM_FASTIO_FPDOR3_PE                      *((volatile  uint8_t *)(0xF8014D01UL))
#define bFM0P_FASTIO_FPDOR3_PE                    *((volatile  uint8_t *)(0xF8014D01UL))
#define bFM_FASTIO_FPDOR3_PF                      *((volatile  uint8_t *)(0xF8014E01UL))
#define bFM0P_FASTIO_FPDOR3_PF                    *((volatile  uint8_t *)(0xF8014E01UL))

#define bFM_FASTIO_FPDOR4_P6                      *((volatile  uint8_t *)(0xF8015100UL))
#define bFM0P_FASTIO_FPDOR4_P6                    *((volatile  uint8_t *)(0xF8015100UL))
#define bFM_FASTIO_FPDOR4_P7                      *((volatile  uint8_t *)(0xF8015200UL))
#define bFM0P_FASTIO_FPDOR4_P7                    *((volatile  uint8_t *)(0xF8015200UL))

#define bFM_FASTIO_FPDOR6_P0                      *((volatile  uint8_t *)(0xF8015804UL))
#define bFM0P_FASTIO_FPDOR6_P0                    *((volatile  uint8_t *)(0xF8015804UL))
#define bFM_FASTIO_FPDOR6_P1                      *((volatile  uint8_t *)(0xF8015808UL))
#define bFM0P_FASTIO_FPDOR6_P1                    *((volatile  uint8_t *)(0xF8015808UL))

