MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1A11B0AGP20000/mcu.h
#define bFM_GPIO_DDRE_P0                          *((volatile  uint8_t *)(0x42664700UL))
#define bFM0P_GPIO_DDRE_P0                        *((volatile  uint8_t *)(0x42664700UL))
#define bFM_GPIO_DDRE_P2                          *((volatile  uint8_t *)(0x42664708UL))
#define bFM0P_GPIO_DDRE_P2                        *((volatile  uint8_t *)(0x42664708UL))
#define bFM_GPIO_DDRE_P3                          *((volatile  uint8_t *)(0x4266470CUL))
#define bFM0P_GPIO_DDRE_P3                        *((volatile  uint8_t *)(0x4266470CUL))

#define bFM_GPIO_EPFR00_NMIS                      *((volatile  uint8_t *)(0x4266C000UL))
#define bFM0P_GPIO_EPFR00_NMIS                    *((volatile  uint8_t *)(0x4266C000UL))
#define bFM_GPIO_EPFR00_USBP0E                    *((volatile  uint8_t *)(0x4266C024UL))
#define bFM0P_GPIO_EPFR00_USBP0E                  *((volatile  uint8_t *)(0x4266C024UL))
#define bFM_GPIO_EPFR00_SWDEN                     *((volatile  uint8_t *)(0x4266C040UL))
#define bFM0P_GPIO_EPFR00_SWDEN                   *((volatile  uint8_t *)(0x4266C040UL))

#define bFM_GPIO_EPFR01_DTTI0C                    *((volatile  uint8_t *)(0x4266C0B0UL))
#define bFM0P_GPIO_EPFR01_DTTI0C                  *((volatile  uint8_t *)(0x4266C0B0UL))
#define bFM_GPIO_EPFR01_IGTRG0                    *((volatile  uint8_t *)(0x4266C0B4UL))
#define bFM0P_GPIO_EPFR01_IGTRG0                  *((volatile  uint8_t *)(0x4266C0B4UL))

#define bFM_GPIO_EPFR21_QAIN0S                    *((volatile  uint8_t *)(0x4266CA80UL))
#define bFM0P_GPIO_EPFR21_QAIN0S                  *((volatile  uint8_t *)(0x4266CA80UL))
#define bFM_GPIO_EPFR21_QBIN0S                    *((volatile  uint8_t *)(0x4266CA84UL))
#define bFM0P_GPIO_EPFR21_QBIN0S                  *((volatile  uint8_t *)(0x4266CA84UL))
#define bFM_GPIO_EPFR21_QZIN0S                    *((volatile  uint8_t *)(0x4266CA88UL))
#define bFM0P_GPIO_EPFR21_QZIN0S                  *((volatile  uint8_t *)(0x4266CA88UL))

#define bFM_GPIO_FPOER0_P1                        *((volatile  uint8_t *)(0x42672004UL))
#define bFM0P_GPIO_FPOER0_P1                      *((volatile  uint8_t *)(0x42672004UL))
#define bFM_GPIO_FPOER0_P3                        *((volatile  uint8_t *)(0x4267200CUL))
#define bFM0P_GPIO_FPOER0_P3                      *((volatile  uint8_t *)(0x4267200CUL))
#define bFM_GPIO_FPOER0_P4                        *((volatile  uint8_t *)(0x42672010UL))
#define bFM0P_GPIO_FPOER0_P4                      *((volatile  uint8_t *)(0x42672010UL))
#define bFM_GPIO_FPOER0_PF                        *((volatile  uint8_t *)(0x4267203CUL))
#define bFM0P_GPIO_FPOER0_PF                      *((volatile  uint8_t *)(0x4267203CUL))

#define bFM_GPIO_FPOER1_P1                        *((volatile  uint8_t *)(0x42672084UL))
#define bFM0P_GPIO_FPOER1_P1                      *((volatile  uint8_t *)(0x42672084UL))
#define bFM_GPIO_FPOER1_P2                        *((volatile  uint8_t *)(0x42672088UL))
#define bFM0P_GPIO_FPOER1_P2                      *((volatile  uint8_t *)(0x42672088UL))
#define bFM_GPIO_FPOER1_P3                        *((volatile  uint8_t *)(0x4267208CUL))
#define bFM0P_GPIO_FPOER1_P3                      *((volatile  uint8_t *)(0x4267208CUL))

#define bFM_GPIO_FPOER2_P1                        *((volatile  uint8_t *)(0x42672104UL))
#define bFM0P_GPIO_FPOER2_P1                      *((volatile  uint8_t *)(0x42672104UL))
#define bFM_GPIO_FPOER2_P2                        *((volatile  uint8_t *)(0x42672108UL))
#define bFM0P_GPIO_FPOER2_P2                      *((volatile  uint8_t *)(0x42672108UL))
#define bFM_GPIO_FPOER2_P3                        *((volatile  uint8_t *)(0x4267210CUL))
#define bFM0P_GPIO_FPOER2_P3                      *((volatile  uint8_t *)(0x4267210CUL))

#define bFM_GPIO_FPOER3_PA                        *((volatile  uint8_t *)(0x426721A8UL))
#define bFM0P_GPIO_FPOER3_PA                      *((volatile  uint8_t *)(0x426721A8UL))
#define bFM_GPIO_FPOER3_PB                        *((volatile  uint8_t *)(0x426721ACUL))
#define bFM0P_GPIO_FPOER3_PB                      *((volatile  uint8_t *)(0x426721ACUL))
#define bFM_GPIO_FPOER3_PC                        *((volatile  uint8_t *)(0x426721B0UL))
#define bFM0P_GPIO_FPOER3_PC                      *((volatile  uint8_t *)(0x426721B0UL))
#define bFM_GPIO_FPOER3_PD                        *((volatile  uint8_t *)(0x426721B4UL))
#define bFM0P_GPIO_FPOER3_PD                      *((volatile  uint8_t *)(0x426721B4UL))
#define bFM_GPIO_FPOER3_PE                        *((volatile  uint8_t *)(0x426721B8UL))
#define bFM0P_GPIO_FPOER3_PE                      *((volatile  uint8_t *)(0x426721B8UL))
#define bFM_GPIO_FPOER3_PF                        *((volatile  uint8_t *)(0x426721BCUL))
#define bFM0P_GPIO_FPOER3_PF                      *((volatile  uint8_t *)(0x426721BCUL))

#define bFM_GPIO_FPOER4_P6                        *((volatile  uint8_t *)(0x42672218UL))
#define bFM0P_GPIO_FPOER4_P6                      *((volatile  uint8_t *)(0x42672218UL))
#define bFM_GPIO_FPOER4_P7                        *((volatile  uint8_t *)(0x4267221CUL))
#define bFM0P_GPIO_FPOER4_P7                      *((volatile  uint8_t *)(0x4267221CUL))

#define bFM_GPIO_FPOER6_P0                        *((volatile  uint8_t *)(0x42672300UL))
#define bFM0P_GPIO_FPOER6_P0                      *((volatile  uint8_t *)(0x42672300UL))
#define bFM_GPIO_FPOER6_P1                        *((volatile  uint8_t *)(0x42672304UL))
#define bFM0P_GPIO_FPOER6_P1                      *((volatile  uint8_t *)(0x42672304UL))

#define bFM_GPIO_FPOERE_P0                        *((volatile  uint8_t *)(0x42672700UL))
#define bFM0P_GPIO_FPOERE_P0                      *((volatile  uint8_t *)(0x42672700UL))
#define bFM_GPIO_FPOERE_P2                        *((volatile  uint8_t *)(0x42672708UL))
#define bFM0P_GPIO_FPOERE_P2                      *((volatile  uint8_t *)(0x42672708UL))
#define bFM_GPIO_FPOERE_P3                        *((volatile  uint8_t *)(0x4267270CUL))
#define bFM0P_GPIO_FPOERE_P3                      *((volatile  uint8_t *)(0x4267270CUL))

